# Parameter Type Id Rebar Shape Crank End Length Property

Source: https://www.revitapidocs.com/2026/2a334a41-342e-194f-6bfd-a6ac6a671fa9.htm

---

| Parameter Type Id Rebar Shape Crank End Length Property |
| --- |

"End Crank Length"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RebarShapeCrankEndLength { get; }
```

```
Public Shared ReadOnly Property RebarShapeCrankEndLength As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RebarShapeCrankEndLength {
	ForgeTypeId^ get ();
}
```

```
static member RebarShapeCrankEndLength : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace